[
  {
    "id": "geomax",
    "name": "GEOMAX",
    "title": "Geometry Dash Rankings Platform",
    "logo": "images/works/Geomax/logo.svg",
    "images": {
      "mainCard": "/images/works/placeholder-image.jpg",
      "showcaseCard": "/images/works/Geomax/showcaseImage.jpg",
      "desktopHome": "/images/works/Geomax/desktopHomeImage.jpg",
      "mobileHome": "/images/works/Geomax/mobileHomeImage.jpg",
      "documentation": [
        "/images/works/Geomax/wide-image.jpg",
        "/images/works/Geomax/square-image.jpg",
        "/images/works/Geomax/square-image-2.jpg",
        "/images/works/Geomax/wide-image-2.jpg"
      ]
    },
    "year": "2023",
    "description": "A website that centralizes and displays the highest global scores on the most challenging levels of the game Geometry Dash.",
    "stack": [
      "HTML5",
      "CSS3",
      "Javascript",
      "React",
      "Webpack",
      "Python",
      "Django",
      "Figma"
    ],
    "github": "https://github.com/Gxbito/e-commerce",
    "demo": "https://www.geomax.site/",
    "colors": {
      "text": "#AFE0FF",
      "shadow": "#026C9E",
      "gradientStart": "#011E34",
      "gradientEnd": "#009CFF"
    },
    "sections": [
      {
        "title": "Overview",
        "content": [
          {
            "type": "paragraph",
            "text": "The GEOMAX team—a global ranking platform for Geometry Dash players—reached out to me with a clear issue: their website had an outdated design, lacked intuitiveness, and offered a limited user experience. They needed a complete redesign that matched the standards of the competitive community using it daily."
          },
          {
            "type": "paragraph",
            "text": "My role was to completely overhaul the frontend, starting with redesigning each section in Figma and then developing everything from scratch using modern technologies like <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, and <strong>React</strong>. The goal was to create a cleaner, more appealing, and functional experience without disrupting the existing data managed by the backend."
          }
        ]
      },
      {
        "title": "Technologies",
        "content": [
          {
            "type": "paragraph",
            "text": "The project was redesigned from scratch in Figma and then developed using HTML, CSS, JavaScript, and React. I also integrated Django as the backend, working alongside a backend developer to deliver a fully dynamic experience."
          },
          {
            "type": "paragraph",
            "text": "The entire system was structured with reusable components, making future updates and collaborations much more efficient."
          }
        ]
      },
      {
        "title": "Challenges",
        "content": [
          {
            "type": "paragraph",
            "text": "The biggest challenge was cleaning up the technical mess left by a previous developer: unreadable spaghetti code, disorganized folders, and confusing logic. I deleted all unnecessary files, restructured the entire project, and rebuilt everything from scratch—while maintaining essential backend connections with Django."
          },
          {
            "type": "paragraph",
            "text": "Additionally, this was my first time collaborating with a backend developer, which required me to quickly adapt to a more professional and team-based workflow."
          }
        ]
      },
      {
        "title": "Process",
        "content": [
          {
            "type": "paragraph",
            "text": "The process began with a visual and functional audit of the original site. From the start, I knew the redesign had to be not only aesthetic but also strategic—improving usability, prioritizing information, and helping players find what they needed with fewer clicks."
          },
          {
            "type": "paragraph",
            "text": "I designed each section in Figma while staying in constant contact with the team. Every two or three days, I presented updates, received feedback, and made adjustments together. This dynamic made the client feel involved in the process and ensured that decisions were based on real needs."
          }
        ]
      },
      {
        "title": "Lessons Learned",
        "content": [
          {
            "type": "paragraph",
            "text": "This project taught me how to operate confidently in unfamiliar environments, adapt quickly, and collaborate within a technical team. I learned to make tough decisions like completely discarding existing code, to prioritize development quality over speed, and to think long-term with every line I wrote."
          },
          {
            "type": "paragraph",
            "text": "It also strengthened my communication skills—clearly presenting progress, proposing solutions when the team wasn’t sure what they needed, and turning rough ideas into concrete features."
          }
        ]
      },
      {
        "title": "Future Evolution",
        "content": [
          {
            "type": "paragraph",
            "text": "GEOMAX still has massive untapped potential. In the short and medium term, the team plans to add new social features that let players interact, follow profiles, comment on scores, and build communities around the rankings."
          },
          {
            "type": "paragraph",
            "text": "They're also considering a gamified reward system, where users can unlock badges or achievements by completing weekly challenges or reaching certain scores on the custom roulette. This would not only boost user retention but also make the platform a more immersive experience."
          },
          {
            "type": "paragraph",
            "text": "Additionally, there's a plan to implement advanced statistical graphs using libraries like D3 or Chart.js to visualize historical player performance and global trends in real time."
          }
        ]
      },
      {
        "title": "Key Features",
        "content": [
          {
            "type": "list",
            "items": [
              "<strong>Dynamic Roulette:</strong> I built an interactive roulette in React that generates random levels based on the user’s selected filters. These levels are grouped and can be saved to tackle them in a suggested order.",
              "<strong>Light/Dark Mode:</strong> The site theme changes automatically using CSS variables, improving accessibility and visual comfort.",
              "<strong>Custom Animated Backgrounds:</strong> I designed a visual background featuring game characters that scrolls smoothly, creating an immersive experience without sacrificing performance.",
              "<strong>User Profiles with History:</strong> Users can store their roulettes, track progress, and manage challenges from their personal accounts."
            ]
          }
        ]
      },
      {
        "title": "Integrations",
        "content": [
          {
            "type": "list",
            "items": [
              "<strong>React Router</strong> for seamless view navigation.",
              "<strong>React Icons</strong> for modern, customizable iconography.",
              "Integration with a <strong>Django + SQLite</strong> backend, with encrypted data and custom logic for user authentication and testing.",
              "Dynamic Django blocks embedded in React code to render server content.",
              "Tools and scripts for rapid testing with dummy accounts provided by the backend developer."
            ]
          }
        ]
      },
      {
        "title": "Documentation",
        "content": [
          {
            "type": "paragraph",
            "text": "Every file and component is thoroughly commented and organized based on functionality. Naming conventions are consistent and clear, and the code is structured so any team member—current or future—can jump in without wasting time figuring out how things work."
          },
          {
            "type": "paragraph",
            "text": "Additionally, styling conventions and the overall project structure were documented to ensure a solid foundation for ongoing development."
          }
        ]
      }
    ]
  },
  {
    "id": "nettv-magazine",
    "name": "NETTV MAGAZINE",
    "title": "Informational Page for an International Brand",
    "logo": "images/works/NETTVMagazine/logo.svg",
    "images": {
      "mainCard": "/images/works/placeholder-image.jpg",
      "showcaseCard": "/images/works/NETTVMagazine/showcaseImage.jpg",
      "desktopHome": "/images/works/NETTVMagazine/desktopHomeImage.jpg",
      "mobileHome": "/images/works/NETTVMagazine/mobileHomeImage.jpg",
      "documentation": [
        "/images/works/NETTVMagazine/wide-image.jpg",
        "/images/works/NETTVMagazine/square-image.jpg",
        "/images/works/NETTVMagazine/square-image-2.jpg",
        "/images/works/NETTVMagazine/wide-image-2.jpg"
      ]
    },
    "year": "2023",
    "description": "An innovative platform designed to transform the online shopping experience.",
    "stack": ["HTML5", "CSS3", "Javascript", "Hubspot", "Figma"],
    "github": "https://github.com/Gxbito/e-commerce",
    "demo": "https://nettv-magazine.vercel.app/index.html",
    "colors": {
      "text": "#A0A0A0",
      "shadow": "#1E1E1E",
      "gradientStart": "#000000",
      "gradientEnd": "#2C2C2C"
    },
    "sections": [
      {
        "title": "Overview",
        "content": [
          {
            "type": "paragraph",
            "text": "This project came from the need of an Israeli group (either a company or community) for a modern and minimalist website to serve as a digital showcase for their content. They contacted me through Fiverr with a clear idea: they wanted a simple, straightforward page with no distractions, featuring a prominent image, a functional form, and several sections for articles, recent news, and highlighted brands."
          },
          {
            "type": "paragraph",
            "text": "The work involved designing a responsive, elegant, and functional website from scratch using only HTML, CSS, and JavaScript — no frameworks. Additionally, multiple screens were created using the same layout but with different headers and images, tailored to various purposes across the site."
          }
        ]
      },
      {
        "title": "Technologies",
        "content": [
          {
            "type": "paragraph",
            "text": "For this project, I decided to keep the stack lightweight yet robust, making the most of classic web development without unnecessary dependencies:"
          },
          {
            "type": "list",
            "items": [
              "<strong>Pure HTML & CSS:</strong> For a clear structure and clean design that loads fast on any device.",
              "<strong>JavaScript:</strong> For dynamic features like loading articles from an editable JSON file.",
              "<strong>JSON:</strong> Integrated to allow the client to manually edit news titles and content without touching the source code."
            ]
          }
        ]
      },
      {
        "title": "Challenges",
        "content": [
          {
            "type": "paragraph",
            "text": "One of the main challenges was maintaining constant communication in English with the client. Although I already had experience with the language, it was the first time I worked directly with a foreign client on a daily basis."
          },
          {
            "type": "paragraph",
            "text": "They also requested the integration of a Hubspot form, which was completely new to me at the time. I had to study their documentation, understand how to adapt it to the design, and ensure it worked correctly across all screens of the site."
          }
        ]
      },
      {
        "title": "Process",
        "content": [
          {
            "type": "paragraph",
            "text": "The development was very smooth and collaborative. I designed and coded iteratively, showing daily progress through Fiverr. At the client’s request, I deployed the site on Vercel from day one so they could see real-time progress and give immediate feedback. This workflow allowed us to adjust details on the fly and ensure the final result matched their expectations."
          },
          {
            "type": "paragraph",
            "text": "Additionally, I received all texts, images, and articles in a document, which I converted into an editable JSON file. I structured the content in a way that anyone on the team could update it without technical knowledge."
          }
        ]
      },
      {
        "title": "Lessons Learned",
        "content": [
          {
            "type": "paragraph",
            "text": "This project helped me consolidate my communication fluency in English in a professional environment and overcome the fear of working directly with international clients. I also learned how to work with embedded forms from external platforms like Hubspot, and to develop with a focus on simplicity and visual efficiency."
          },
          {
            "type": "paragraph",
            "text": "I also strengthened my adaptability and quick delivery skills, since the project had to be completed in just a few days with very specific requirements."
          }
        ]
      },
      {
        "title": "Future Evolution",
        "content": [
          {
            "type": "paragraph",
            "text": "While the site currently fulfills its purpose, it has great potential for future growth. Some ideas for its evolution include:"
          },
          {
            "type": "list",
            "items": [
              "Adding a user system so visitors can save articles or leave comments.",
              "Creating a simple admin panel to edit content without manually modifying the JSON.",
              "Redesigning the layout with a more dynamic and engaging aesthetic.",
              "Adding categories, tags, and filters to improve navigation through news content.",
              "Improving accessibility and performance for a global audience."
            ]
          }
        ]
      },
      {
        "title": "Key Features",
        "content": [
          {
            "type": "list",
            "items": [
              "<strong>Integrated contact form (Hubspot)</strong> directly in the header, with different versions depending on the section.",
              "<strong>Interactive cards</strong> for each brand, with links to their respective websites.",
              "<strong>Dynamic loading of news and articles</strong> from an editable JSON file, making manual updates easy for the client.",
              "<strong>Responsive and lightweight design</strong>, optimized for fast loading and full device compatibility."
            ]
          }
        ]
      },
      {
        "title": "Integrations",
        "content": [
          {
            "type": "paragraph",
            "text": "This site benefited from a simple but effective integration:"
          },
          {
            "type": "list",
            "items": [
              "<strong>Hubspot Forms:</strong> to capture leads without the need to develop a backend.",
              "<strong>Vercel:</strong> as a real-time deployment environment during development."
            ]
          },
          {
            "type": "paragraph",
            "text": "Thanks to this, the client could follow the site’s progress without technical barriers and stay connected with users from day one."
          }
        ]
      },
      {
        "title": "Documentation",
        "content": [
          {
            "type": "paragraph",
            "text": "A clear folder and file structure was created:"
          },
          {
            "type": "list",
            "items": [
              "<strong>index.html</strong>, <strong>style.css</strong>, <strong>main.js</strong>: base structure.",
              "<strong>data.json:</strong> editable file with article and news titles and images.",
              "In-code comments explaining each section, class, or function.",
              "Use of descriptive <strong>alt</strong> tags in images to ease future editing.",
              "Recommendations on how to modify the JSON, change images, or update brand links."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "more-time",
    "name": "MORE TIME",
    "title": "Product Landing Page on Shopify",
    "logo": "images/works/MoreTime/logo.svg",
    "images": {
      "mainCard": "/images/works/placeholder-image.jpg",
      "showcaseCard": "/images/works/MoreTime/showcaseImage.jpg",
      "desktopHome": "/images/works/MoreTime/desktopHomeImage.jpg",
      "mobileHome": "/images/works/MoreTime/mobileHomeImage.jpg",
      "documentation": [
        "/images/works/MoreTime/wide-image.jpg",
        "/images/works/MoreTime/square-image.jpg",
        "/images/works/MoreTime/square-image-2.jpg",
        "/images/works/MoreTime/wide-image-2.jpg"
      ]
    },
    "year": "2024",
    "description": "A direct sales page for a male-focused spray, aimed at quick and effective conversion.",
    "stack": ["Shopify", "HTML5", "CSS3", "Javascript", "PHP", "Figma"],
    "github": "https://github.com/Gxbito/e-commerce",
    "demo": "",
    "colors": {
      "text": "#CBBEFF",
      "shadow": "#271759",
      "gradientStart": "#120D26",
      "gradientEnd": "#372275"
    },
    "sections": [
      {
        "title": "Overview",
        "content": [
          {
            "type": "paragraph",
            "text": "A Spanish entrepreneur contacted me via Fiverr to launch MORE TIME, a men's intimate spray brand. The goal was to create an attractive, functional landing page aligned with the product’s branding, based on a design provided by their Product Designer."
          },
          {
            "type": "paragraph",
            "text": "My role was to turn that design into a fully functional website within the Shopify ecosystem, focused on quick conversion during a limited-time sales campaign."
          }
        ]
      },
      {
        "title": "Technologies",
        "content": [
          {
            "type": "paragraph",
            "text": "Shopify presents limitations for custom frontend development, so I leveraged advanced HTML and CSS to build a smooth, responsive page adapted to the original design."
          },
          {
            "type": "list",
            "items": [
              "<strong>Pure HTML & CSS:</strong> To precisely match the Product Designer’s layout.",
              "<strong>Official Shopify plugins:</strong> To integrate payment gateways, tracking, and ecommerce features.",
              "<strong>Customized base theme:</strong> Modified directly through Shopify's code editor."
            ]
          }
        ]
      },
      {
        "title": "Challenges",
        "content": [
          {
            "type": "paragraph",
            "text": "This was my first professional project using Shopify, and also my first time collaborating directly with a Product Designer. I had to adapt to a limited editing environment while accurately interpreting visual guidelines to maintain the expected look and feel."
          },
          {
            "type": "paragraph",
            "text": "We also worked under a tight schedule since the product would be sold for a limited time. This required quick turnarounds and constant communication via WhatsApp and video calls."
          }
        ]
      },
      {
        "title": "Process",
        "content": [
          {
            "type": "paragraph",
            "text": "I designed two initial versions based on the product’s branding. Once the final design was approved, I began modifying a Shopify theme directly in the code."
          },
          {
            "type": "paragraph",
            "text": "The development process was iterative: I presented progress in weekly calls and received immediate feedback. This dynamic allowed me to fine-tune details on the fly and launch the site quickly without compromising quality."
          }
        ]
      },
      {
        "title": "Lessons Learned",
        "content": [
          {
            "type": "paragraph",
            "text": "I learned how to work within the Shopify environment and make the most of custom code despite its constraints. I also improved my communication skills in professional settings and learned to collaborate more effectively with product designers."
          },
          {
            "type": "paragraph",
            "text": "This project strengthened my adaptability, especially when working with limited resources and under time pressure. It was great training in efficiency, collaboration, and professional delivery."
          }
        ]
      },
      {
        "title": "Future Evolution",
        "content": [
          {
            "type": "paragraph",
            "text": "Although the MORE TIME product page was conceived as a temporary landing page for the brand's initial launch, its modular and scalable structure allows for many possibilities should the project be relaunched or become more permanent."
          },
          {
            "type": "list",
            "items": [
              "Transform the landing into a full e-commerce site with product catalog, user login, and a rewards system.",
              "Add a video testimonials or verified reviews section to increase trust and product credibility.",
              "Implement an affiliate or referral system to expand organic reach and boost conversions.",
              "Develop a Progressive Web App (PWA) to enable mobile purchases as if it were a native app.",
              "Integrate monthly subscription features or bundles with time-limited promotional offers."
            ]
          },
          {
            "type": "paragraph",
            "text": "Thanks to its solid foundation in HTML, CSS, and JS, and its initial Shopify integration, any future expansion can be developed quickly without rebuilding the project from scratch."
          }
        ]
      },
      {
        "title": "Key Features",
        "content": [
          {
            "type": "list",
            "items": [
              "<strong>100% responsive, conversion-focused design:</strong> Each section was crafted to lead users toward action, with a clear visual hierarchy, strong call-to-action buttons, and strategically placed testimonials.",
              "<strong>Integrated payment gateways:</strong> I used official Shopify plugins to activate multiple payment methods (credit cards, digital wallets, and more), ensuring a smooth shopping experience.",
              "<strong>Basic SEO optimization:</strong> Content was structured using semantic tags, clean URLs, and fast loading times to aid search engine visibility.",
              "<strong>Smooth scroll animations and microinteractions:</strong> Enhanced the product's perceived quality through subtle transitions and motion.",
              "<strong>Complete brand alignment:</strong> The visual design adhered strictly to the Product Designer’s guidelines, from color schemes and typography to the tone of voice."
            ]
          }
        ]
      },
      {
        "title": "Integrations",
        "content": [
          {
            "type": "paragraph",
            "text": "MORE TIME was designed to offer a seamless experience from the first click to checkout, so I implemented key tools to support sales flow and user behavior analysis."
          },
          {
            "type": "list",
            "items": [
              "<strong>Shopify Payments & Mercado Pago:</strong> Integrated multiple gateways to serve both European and Latin American markets, enabling global coverage and instant payments.",
              "<strong>Google Analytics + Meta Pixel:</strong> Implemented tracking tools to monitor campaign performance and optimize conversions in real time.",
              "<strong>Klaviyo:</strong> Email marketing system to capture leads and automate post-purchase messaging, using embedded forms and behavior-based triggers.",
              "<strong>Hubspot Forms:</strong> An advanced contact form embedded in the hero section, connected to an external database for lead management and commercial follow-up.",
              "<strong>Vercel (for testing):</strong> During development, I deployed a temporary version on Vercel to allow real-time client reviews and rapid visual/functional validation."
            ]
          },
          {
            "type": "paragraph",
            "text": "These integrations not only supported the product’s initial growth but also laid the foundation for future remarketing, loyalty, and digital expansion strategies."
          }
        ]
      },
      {
        "title": "Documentation",
        "content": [
          {
            "type": "paragraph",
            "text": "I provided detailed instructions so the client could edit text, images, and sections from the Shopify panel without breaking the layout. I also included recommendations for future updates:"
          },
          {
            "type": "list",
            "items": [
              "Explanation of how each editable section works.",
              "Tips on maintaining visual consistency when adding new products.",
              "Guide for backing up the current theme and restoring it in case of errors.",
              "Basic support on how to change images and links."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "advant",
    "name": "ADVANT",
    "title": "Marketing Agency Website on WordPress",
    "logo": "images/works/Advant/logo.svg",
    "images": {
      "mainCard": "/images/works/placeholder-image.jpg",
      "showcaseCard": "/images/works/Advant/showcaseImage.jpg",
      "desktopHome": "/images/works/Advant/desktopHomeImage.jpg",
      "mobileHome": "/images/works/Advant/mobileHomeImage.jpg",
      "documentation": [
        "/images/works/Advant/wide-image.jpg",
        "/images/works/Advant/square-image.jpg",
        "/images/works/Advant/square-image-2.jpg",
        "/images/works/Advant/wide-image-2.jpg"
      ]
    },
    "year": "2024",
    "description": "Corporate website for a U.S.-based digital marketing agency, focused on attracting new clients.",
    "stack": ["WordPress", "WPForms", "Yoast", "Jetpack", "CSS3", "Figma"],
    "github": "https://github.com/Gxbito/e-commerce",
    "demo": "https://advant.biz/",
    "colors": {
      "text": "#FFC9D8",
      "shadow": "#A93E5E",
      "gradientStart": "#38111C",
      "gradientEnd": "#DA5980"
    },
    "sections": [
      {
        "title": "Overview",
        "content": [
          {
            "type": "paragraph",
            "text": "An Argentinian entrepreneur living in the United States contacted me through Fiverr to develop the website for his marketing agency: ADVANT. He already had SEO experience and intermediate technical knowledge, so he was looking for someone to execute his vision in WordPress, following the structure of a reference site he provided."
          },
          {
            "type": "paragraph",
            "text": "My role was to design and build a professional site from scratch, with 7 internal pages, carefully balancing performance, aesthetics, and SEO to meet the agency's goals."
          }
        ]
      },
      {
        "title": "Technologies",
        "content": [
          {
            "type": "paragraph",
            "text": "Although the site was built on WordPress, I aimed to take the development to the next level by using complementary tools to ensure a professional-grade experience:"
          },
          {
            "type": "list",
            "items": [
              "<strong>WordPress + Elementor:</strong> for precise visual layout aligned with the intended design.",
              "<strong>Custom CSS:</strong> to fine-tune styles and overcome CMS visual limitations.",
              "<strong>Code snippets:</strong> for specific features without bloating the site with unnecessary plugins.",
              "<strong>Essential plugins:</strong> WPForms, Jetpack, Yoast SEO, Creativ.eMail, among others."
            ]
          }
        ]
      },
      {
        "title": "Challenges",
        "content": [
          {
            "type": "paragraph",
            "text": "The main challenge was working within WordPress’s limitations. Although I don’t usually rely on CMS tools, I made the most out of its capabilities by combining it with custom code to avoid depending solely on restrictive plugins or themes."
          },
          {
            "type": "paragraph",
            "text": "Additionally, the client wanted to replicate the layout of the reference site while applying completely different branding. This meant redesigning every visual element—color palette, typography, iconography, and images—without altering the base structure."
          }
        ]
      },
      {
        "title": "Process",
        "content": [
          {
            "type": "paragraph",
            "text": "From day one, the client granted me full access to the wp-admin. He already had the domain and hosting set up, so I was able to start right away. I asked him to confirm the number of pages needed, and we began building each one based on the original layout, customized with his branding."
          },
          {
            "type": "paragraph",
            "text": "We followed an iterative workflow: I shared updates daily, screen by screen, and received immediate feedback. This allowed us to move quickly and stay organized. We even collaborated on SEO from the start, leveraging the client’s previous experience in the field."
          }
        ]
      },
      {
        "title": "Lessons Learned",
        "content": [
          {
            "type": "paragraph",
            "text": "This project helped strengthen my CMS skills, especially with WordPress, and gave me a clearer understanding of plugin compatibility. I also learned how to integrate external forms like Hubspot without compromising the site’s design."
          },
          {
            "type": "paragraph",
            "text": "It also improved my ability to work remotely with clients who have strong business vision and technical expertise."
          }
        ]
      },
      {
        "title": "Future Growth",
        "content": [
          {
            "type": "paragraph",
            "text": "While the website was built to meet the agency’s current needs, it’s ready to scale. I also proposed several ideas for future development:"
          },
          {
            "type": "list",
            "items": [
              "Add a private client area with access to personalized reports.",
              "Implement a lightweight CRM directly within WP to manage leads.",
              "Include a live chat for instant customer support.",
              "Expand the blog with multimedia content optimized for SEO.",
              "Build a visual dashboard with visit, conversion, and form submission stats."
            ]
          }
        ]
      },
      {
        "title": "Key Features",
        "content": [
          {
            "type": "list",
            "items": [
              "<strong>Integrated contact forms (Hubspot and WPForms)</strong>, with auto-forwarding to the client’s inbox.",
              "<strong>Custom blog and article section</strong> designed to consistently boost organic SEO.",
              "<strong>Booking system</strong> to easily schedule meetings with potential clients.",
              "<strong>Responsive design aligned with ADVANT's branding</strong>, including custom icons, colors, and typography.",
              "<strong>Essential plugins integrated</strong> for security, backups, and fast loading performance."
            ]
          }
        ]
      },
      {
        "title": "Integrations",
        "content": [
          {
            "type": "paragraph",
            "text": "The site was enhanced with key integrations that not only improved the user experience but also optimized the agency’s internal workflows:"
          },
          {
            "type": "list",
            "items": [
              "<strong>WPForms + Hubspot:</strong> to capture leads with automated email notifications.",
              "<strong>Yoast SEO:</strong> with advanced setup, dynamic titles, and custom meta tags for each page.",
              "<strong>Jetpack:</strong> for site stats, basic security, and automatic backups.",
              "<strong>Google Tag Manager:</strong> to track events and manage marketing campaigns.",
              "<strong>Creativ.eMail:</strong> for newsletter management and welcome email automation."
            ]
          }
        ]
      },
      {
        "title": "Documentation",
        "content": [
          {
            "type": "paragraph",
            "text": "I prepared a basic admin guide and documented everything within WordPress itself:"
          },
          {
            "type": "list",
            "items": [
              "Explanatory comments in each editable Elementor section.",
              "PDF guide on how to publish new articles and configure SEO with Yoast.",
              "Step-by-step tutorial on how to change images, text, and links via the visual editor.",
              "Backup manual for restoring the site using Jetpack in case of errors.",
              "Monthly maintenance recommendations and safe update practices."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "alpha-cycles",
    "name": "Alpha Cycles",
    "title": "Business Optimization with Smart Scheduling",
    "logo": "images/works/AlphaCycles/logo.svg",
    "images": {
      "mainCard": "/images/works/placeholder-image.jpg",
      "showcaseCard": "/images/works/AlphaCycles/showcaseImage.jpg",
      "desktopHome": "/images/works/AlphaCycles/desktopHomeImage.jpg",
      "mobileHome": "/images/works/AlphaCycles/mobileHomeImage.jpg",
      "documentation": [
        "/images/works/AlphaCycles/wide-image.jpg",
        "/images/works/AlphaCycles/square-image.jpg",
        "/images/works/AlphaCycles/square-image-2.jpg",
        "/images/works/AlphaCycles/wide-image-2.jpg"
      ]
    },
    "year": "2024",
    "description": "Website for a motorcycle dealership in Miami showcasing models and services.",
    "stack": [
      "WordPress",
      "Styled Components",
      "CSS3",
      "WooCommerce",
      "Elementor",
      "Yoast",
      "React",
      "PhotoSwipe",
      "WP Engine"
    ],
    "github": "https://github.com/Gxbito/e-commerce",
    "demo": "https://alphacyclesmiami.com/",
    "colors": {
      "text": "#FFD4B1",
      "shadow": "#8C401F",
      "gradientStart": "#2C1A11",
      "gradientEnd": "#BF602F"
    },
    "sections": [
      {
        "title": "Overview",
        "content": [
          {
            "type": "paragraph",
            "text": "Alpha Cycles is a motorcycle dealership based in Miami. The project came about when Marco, the owner of Advant (a previous client), contacted me to help one of his own clients with a specific improvement: to develop a new section on their website where users could <strong>book a personalized appointment</strong> with the owner for motorcycle consultations — aiming to turn those meetings into sales opportunities."
          },
          {
            "type": "paragraph",
            "text": "Even though it was a simple page, the focus was on enabling direct contact with potential buyers, with no friction or lengthy processes. The experience had to be as smooth as possible for both the user and the Alpha Cycles team."
          }
        ]
      },
      {
        "title": "Technologies",
        "content": [
          {
            "type": "paragraph",
            "text": "To build an effective solution, I used simple yet powerful tools:"
          },
          {
            "type": "list",
            "items": [
              "<strong>Elementor Pro:</strong> the site’s main builder, with premium widgets that allowed me to structure the section without complex code.",
              "<strong>WPForms + HubSpot:</strong> a strategic combination to implement booking forms directly connected to the client's CRM.",
              "<strong>Custom CSS:</strong> applied to harmonize the form design with the brand’s visual identity, overcoming the builder’s default limitations.",
              "<strong>WordPress:</strong> as the CMS foundation. Despite some limitations, its ecosystem allowed for quick, precise work on an existing installation without rebuilding anything from scratch."
            ]
          }
        ]
      },
      {
        "title": "Challenges",
        "content": [
          {
            "type": "paragraph",
            "text": "Although it was just a single page, the project came with several key challenges:"
          },
          {
            "type": "list",
            "items": [
              "Quickly integrating into an unfamiliar WordPress environment already built with Elementor Pro.",
              "<strong>Adapting to the dynamic of working for a client’s client</strong>, without direct communication with the end user.",
              "<strong>Custom CSS:</strong> applied to harmonize the form design with the brand’s visual identity, overcoming the builder’s default limitations.",
              "Maintaining a <strong>clean, visually coherent, and frictionless experience</strong> despite the constraints of the existing setup."
            ]
          },
          {
            "type": "paragraph",
            "text": "These kinds of 'small' projects are often underestimated, but their success depends on strategic and meticulous execution. My challenge was to turn a simple page into a <strong>real channel for lead generation and conversion.</strong>"
          }
        ]
      },
      {
        "title": "Process",
        "content": [
          {
            "type": "paragraph",
            "text": "The development was fast yet well-structured:"
          },
          {
            "type": "paragraph",
            "text": "We followed an iterative workflow: I shared updates daily, screen by screen, and received immediate feedback. This allowed us to move quickly and stay organized. We even collaborated on SEO from the beginning, since the client had prior experience in the field."
          }
        ]
      },
      {
        "title": "Lessons Learned",
        "content": [
          {
            "type": "list",
            "items": [
              "I learned to make the <strong>most out of Elementor Pro</strong>, including premium widgets and advanced customization.",
              "I improved my skills at <strong>integrating external tools like HubSpot</strong> into closed visual environments.",
              "I strengthened my adaptability to existing setups and teams already in motion.",
              "I confirmed that even minimal implementations can have a <strong>high commercial impact</strong> if properly designed."
            ]
          }
        ]
      },
      {
        "title": "Future Growth",
        "content": [
          {
            "type": "paragraph",
            "text": "While the project was delivered as a one-off solution, I identified areas with strong potential for expansion:"
          },
          {
            "type": "list",
            "items": [
              "Make the form dynamic depending on the type of inquiry.",
              "<strong>Add customer reviews</strong> to build immediate trust.",
              "Include <strong>automatic reminders</strong> or calendar sync for users.",
              "Add <strong>interactive mini catalogs</strong> featuring highlighted motorcycles as part of the booking flow."
            ]
          }
        ]
      },
      {
        "title": "Key Features",
        "content": [
          {
            "type": "list",
            "items": [
              "<strong>Fully functional and responsive appointment page.</strong>",
              "<strong>Conversion-focused structure</strong> without distracting the user.",
              "Full compatibility with Elementor Pro and the client’s existing setup.",
              "Visual carousel with featured products to strengthen the commercial intent."
            ]
          }
        ]
      },
      {
        "title": "Integrations",
        "content": [
          {
            "type": "paragraph",
            "text": "The site was enhanced with key integrations that not only improved the user experience but also optimized the agency's internal operations:"
          },
          {
            "type": "list",
            "items": [
              "<strong>WPForms + HubSpot:</strong> enabled clean form-to-CRM sync without visual clutter.",
              "<strong>Elementor Pro:</strong> served as the foundation for layout and customization.",
              "<strong>Custom CSS:</strong> for a polished visual finish, without touching the site’s core code."
            ]
          }
        ]
      },
      {
        "title": "Documentation",
        "content": [
          {
            "type": "paragraph",
            "text": "A basic admin guide was prepared, and everything was documented directly within WordPress:"
          },
          {
            "type": "list",
            "items": [
              "Explanatory comments in each editable Elementor section.",
              "PDF guide on how to create new articles and configure SEO with Yoast.",
              "Step-by-step explanation to update images, texts, and links via the visual editor.",
              "Backup manual for restoring the site using Jetpack in case of errors.",
              "Monthly maintenance recommendations and safe update practices."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "sellblink",
    "name": "Sellblink",
    "title": "Real Estate Website Development",
    "logo": "images/works/Sellblink/logo.svg",
    "images": {
      "mainCard": "/images/works/placeholder-image.jpg",
      "showcaseCard": "/images/works/Sellblink/showcaseImage.jpg",
      "desktopHome": "/images/works/Sellblink/desktopHomeImage.jpg",
      "mobileHome": "/images/works/Sellblink/mobileHomeImage.jpg",
      "documentation": [
        "/images/works/Sellblink/wide-image.jpg",
        "/images/works/Sellblink/square-image.jpg",
        "/images/works/Sellblink/square-image-2.jpg",
        "/images/works/Sellblink/wide-image-2.jpg"
      ]
    },
    "year": "2024 / 2025",
    "description": "A real estate website that connects buyers, sellers, and project developers in Peru.",
    "stack": [
      "HTML5",
      "CSS3",
      "Javascript",
      "React",
      "Swiper",
      "Vite",
      "React Router",
      "Figma",
      "Font Awesome",
      "Leaflet",
      "PWA"
    ],
    "github": "https://github.com/Gxbito/e-commerce",
    "demo": "https://www.sellblink.com/",
    "colors": {
      "text": "#FFBABA",
      "shadow": "#5C0000",
      "gradientStart": "#2D0000",
      "gradientEnd": "#940000"
    },
    "sections": [
      {
        "title": "Overview",
        "content": [
          {
            "type": "paragraph",
            "text": "Sellblink (formerly Organización Sánchez) is a Peruvian real estate agency currently undergoing a phase of digital growth. They reached out to me to handle the complete frontend development, based on designs provided by their UX/UI designer."
          },
          {
            "type": "paragraph",
            "text": "The work was structured through modular contracts, each covering between 5 and 10 new pages. From the start, I joined as the dedicated frontend developer, working alongside a designer and a backend developer within an already established workflow."
          }
        ]
      },
      {
        "title": "Technologies",
        "content": [
          {
            "type": "paragraph",
            "text": "The project was built using React, with pure HTML, CSS, and JavaScript for more specific details. Libraries included:"
          },
          {
            "type": "list",
            "items": [
              "<strong>react-slick</strong>, for dynamic sliders.",
              "<strong>react-icons</strong>, to visually enrich the components.",
              "Various utilities for modals and carousels."
            ]
          },
          {
            "type": "paragraph",
            "text": "Bootstrap was intentionally avoided (as requested by the client), opting instead for fully custom components."
          }
        ]
      },
      {
        "title": "Challenges",
        "content": [
          {
            "type": "paragraph",
            "text": "One of the main challenges was joining a project with pre-existing code, built by a backend developer with their own conventions. I was asked to place all my components inside a /custom folder to keep things organized."
          },
          {
            "type": "paragraph",
            "text": "Another challenge was following a design that wasn’t mine, which required extreme precision with measurements, spacing, and tokens from the original Figma file."
          },
          {
            "type": "paragraph",
            "text": "I also had to analyze the layout structure, which originally relied on rigid templates, and propose a new, cleaner and more scalable system."
          }
        ]
      },
      {
        "title": "Process",
        "content": [
          {
            "type": "paragraph",
            "text": "The development followed an agile workflow, organized through milestone-based contracts. Each batch included a set of Figma-designed pages that I had to replicate as faithfully as possible in code."
          },
          {
            "type": "paragraph",
            "text": "I started by analyzing the designer’s tokens and variables (typography, spacing, color palette, etc.), then defined a custom layout structure to replace the old template-based system. This allowed me to build a cleaner, more scalable environment while maintaining visual consistency."
          },
          {
            "type": "paragraph",
            "text": "Once the pages were implemented, I updated the team via our shared group — designer, backend developer, and client — with daily progress, push notes, and any questions or suggestions for the next iteration. This constant communication was key to keeping the project smooth and efficient, allowing for quick visual and technical adjustments."
          }
        ]
      },
      {
        "title": "Lessons learned",
        "content": [
          {
            "type": "paragraph",
            "text": "This project helped me grow professionally in several ways:"
          },
          {
            "type": "list",
            "items": [
              "I learned to collaborate smoothly in a remote, multidisciplinary team.",
              "I adapted quickly to a pre-structured development environment.",
              "I improved my skills in building reusable components and scaling projects without relying on frameworks like Bootstrap.",
              "I strengthened my ability to precisely follow third-party designs."
            ]
          }
        ]
      },
      {
        "title": "Future evolution",
        "content": [
          {
            "type": "paragraph",
            "text": "Sellblink is constantly evolving, and the roadmap includes several enhancements:"
          },
          {
            "type": "list",
            "items": [
              "User login and account management features.",
              "Functionality to save properties from the user account.",
              "Advanced modules like language selector, currency switcher, and theme toggles (e.g., dark mode).",
              "Integration with payment systems and custom animations to improve UX."
            ]
          }
        ]
      },
      {
        "title": "Key features",
        "content": [
          {
            "type": "list",
            "items": [
              "Dynamic sliders for properties and banners.",
              "Search system with multiple filters (property type, region, price, etc.).",
              "Interactive maps to show exact location.",
              "Dynamic views that adapt layout based on content type.",
              "Optimized pagination for long catalogs of properties and agents."
            ]
          }
        ]
      },
      {
        "title": "Integrations",
        "content": [
          {
            "type": "list",
            "items": [
              "<strong>React Slick</strong> for sliders",
              "<strong>Custom API</strong> for properties, agents, and content",
              "<strong>React Icons</strong>",
              "<strong>Modal and carousel libraries</strong>",
              "Full integration with the existing backend structure"
            ]
          }
        ]
      },
      {
        "title": "Documentation",
        "content": [
          {
            "type": "paragraph",
            "text": "All technical documentation was organized into clear sections, including:"
          },
          {
            "type": "list",
            "items": [
              "Folder structure (/custom for custom components).",
              "Global variables defined by design (colors, fonts, breakpoints).",
              "Internal development standards to stay consistent with the backend.",
              "Commit, push, and delivery conventions for each contract."
            ]
          }
        ]
      }
    ]
  },
  {
    "id": "edvance",
    "name": "Edvance",
    "title": "Landing Page for a Corporate Training Company",
    "logo": "images/works/Edvance/logo.svg",
    "images": {
      "mainCard": "/images/works/placeholder-image.jpg",
      "showcaseCard": "/images/works/Edvance/showcaseImage.jpg",
      "desktopHome": "/images/works/Edvance/desktopHomeImage.jpg",
      "mobileHome": "/images/works/Edvance/mobileHomeImage.jpg",
      "documentation": [
        "/images/works/Edvance/wide-image.jpg",
        "/images/works/Edvance/square-image.jpg",
        "/images/works/Edvance/square-image-2.jpg",
        "/images/works/Edvance/wide-image-2.jpg"
      ]
    },
    "year": "2025",
    "description": "A modern and functional landing page for a Chilean company offering corporate training courses.",
    "stack": [
      "HTML5",
      "CSS3",
      "Javascript",
      "React",
      "Styled Components",
      "Swiper",
      "Vite",
      "Figma"
    ],
    "github": "https://github.com/Gxbito/e-commerce",
    "demo": "https://www.edvance.cl/",
    "colors": {
      "text": "#D5CDFF",
      "shadow": "#4B38A3",
      "gradientStart": "#1E153A",
      "gradientEnd": "#7F64F3"
    },
    "sections": [
      {
        "title": "Overview",
        "content": [
          {
            "type": "paragraph",
            "text": "Edvance is a Chilean company that sells training courses for corporate staff. I was contacted by the client through Fiverr to design and develop an institutional landing page."
          },
          {
            "type": "paragraph",
            "text": "The main goal of the site was to convey professionalism, clarity, and trust, aiming for conversions through a contact form, while the platform where the courses will be hosted is still under development."
          }
        ]
      },
      {
        "title": "Technologies",
        "content": [
          {
            "type": "paragraph",
            "text": "The stack combined classic tools with modern best practices:"
          },
          {
            "type": "list",
            "items": [
              "<strong>HTML, CSS, and JavaScript:</strong> for the structure and styling of the site.",
              "<strong>React:</strong> used for a cleaner, component-based architecture.",
              "<strong>Vite:</strong> to quickly bootstrap the project with optimal performance.",
              "<strong>React Icons and React Slick:</strong> for icons and carousels."
            ]
          }
        ]
      },
      {
        "title": "Challenges",
        "content": [
          {
            "type": "paragraph",
            "text": "The development process was smooth and didn't present any major technical challenges. Both the tech stack and the type of implementation were well within my professional scope. Collaboration with the backend developer was straightforward and focused on form submission."
          },
          {
            "type": "paragraph",
            "text": "Working with the designer was also easy, as her role was strictly related to branding."
          }
        ]
      },
      {
        "title": "Process",
        "content": [
          {
            "type": "paragraph",
            "text": "The client provided a specific visual reference for the hero section and a hand-drawn sketch outlining the four sections the site should have."
          },
          {
            "type": "paragraph",
            "text": "From there, I designed each section, respecting the visual hierarchy and the identity proposed by the designer. Once the design was complete, I presented three versions using different applications of the brand color, plus a neutral version."
          },
          {
            "type": "paragraph",
            "text": "The client chose the neutral one, and from that point on, I started the development. The site was built section by section, focusing on pixel-perfect implementation, responsive design, and clean structure. After the build, I integrated the contact form with the backend using a simple try/catch approach."
          }
        ]
      },
      {
        "title": "Lessons Learned",
        "content": [
          {
            "type": "paragraph",
            "text": "Even though it was a straightforward project, I gained valuable experience in:"
          },
          {
            "type": "list",
            "items": [
              "Integrating backend functionality efficiently for a targeted feature like a form.",
              "Translating simple visual references into clear, professional solutions.",
              "Presenting design alternatives to reach visual consensus with the client and their team."
            ]
          }
        ]
      },
      {
        "title": "Future Evolution",
        "content": [
          {
            "type": "paragraph",
            "text": "Possible improvements for future iterations include:"
          },
          {
            "type": "list",
            "items": [
              "Smooth entrance animations for sections and cards.",
              "Enhanced form UX with real-time visual feedback.",
              "Integration of the course platform (once completed) as a key part of the site."
            ]
          }
        ]
      },
      {
        "title": "Key Features",
        "content": [
          {
            "type": "list",
            "items": [
              "Hero section with a visual slider.",
              "Functional contact form.",
              "Clear, well-differentiated sections.",
              "Clean, professional, and responsive design.",
              "Seamless experience on both mobile and desktop.",
              "Modern text slider with an institutional tone."
            ]
          }
        ]
      },
      {
        "title": "Integrations",
        "content": [
          {
            "type": "list",
            "items": [
              "<strong>React Slick</strong> for sliders",
              "<strong>React Icons</strong> to enhance visual content",
              "<strong>Try/catch</strong> with backend to handle the form"
            ]
          }
        ]
      },
      {
        "title": "Documentation",
        "content": [
          {
            "type": "paragraph",
            "text": "The project is organized with a clear structure of reusable components. The code follows a folder structure separating sections, assets, and icons, and includes comments to ease future expansion."
          },
          {
            "type": "paragraph",
            "text": "The form is decoupled to allow integration with any external API or backend. The design was built with accessibility, scalability, and responsiveness in mind, ensuring it can evolve both visually and functionally."
          }
        ]
      }
    ]
  }
]
